Catalogs/ОрганизацииОблачныхПриложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОрганизацииОблачныхПриложений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ОблачныеПриложения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ОрганизацииОблачныхПриложений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает организацию приложения по идентификатору. Создает отсутствующий экземпляр.
//
// Параметры:
//   Идентификатор - Строка - идентификатор организации
//   Приложение - СправочникСсылка.ОблачныеПриложения - экземпляр приложения, в котором ведется учет по этой организации
//   Наименование - Строка - наименование организации
//   ИНН - Строка - ИНН организации
//   КПП - Строка - КПП организации
//
// Возвращаемое значение:
//   СправочникСсылка.ОрганизацииОблачныхПриложений - ссылка на организацию
//
Функция СсылкаОрганизация(Идентификатор, Приложение, Наименование, ИНН, КПП) Экспорт
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.ИНН КАК ИНН,
	|	Организации.КПП КАК КПП
	|ИЗ
	|	Справочник.ОрганизацииОблачныхПриложений КАК Организации
	|ГДЕ
	|	Организации.Код = &Идентификатор
	|	И Организации.Владелец = &Приложение";
	Запрос.Параметры.Вставить("Идентификатор", Идентификатор);
	Запрос.Параметры.Вставить("Приложение", Приложение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Если ЗначениеЗаполнено(ИНН) И ЗначениеЗаполнено(КПП)
			И Выборка.ИНН <> ИНН И Выборка.КПП <> КПП Тогда
			ОбновитьИННиКПП(Выборка.Ссылка, ИНН, КПП)
		КонецЕсли;
		
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Попытка
		НачатьТранзакцию();
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ОрганизацииОблачныхПриложений");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОтменитьТранзакцию();
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
		Организация = Справочники.ОрганизацииОблачныхПриложений.СоздатьЭлемент();
		Организация.Наименование = СокрЛП(Наименование);
		Организация.Код = Идентификатор;
		Организация.Владелец = Приложение;
		Если ЗначениеЗаполнено(ИНН) Тогда
			Организация.ИНН = СокрЛП(ИНН);
		КонецЕсли;
		Если ЗначениеЗаполнено(КПП) Тогда
			Организация.КПП = СокрЛП(КПП);
		КонецЕсли;
		
		Организация.Записать();
		ЗафиксироватьТранзакцию();
		
		Возврат Организация.Ссылка;
	Исключение
		
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Организации облачных приложений'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка, , , 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

// Возвращает наименование организации.
//
// Параметры:
//   Организация - СправочникСсылка.ОрганизацииОблачныхПриложений - ссылка на организацию
//
// Возвращаемое значение:
//   Строка - наименование организации
//
Функция НаименованиеОрганизации(Организация) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "Наименование");
	
КонецФункции

// Обновляет наименование организации.
//
// Параметры:
//   Организация - СправочникСсылка.ОрганизацииОблачныхПриложений - ссылка на организацию,
//   Наименование - Строка - новое наименование
//
Процедура Переименовать(Организация, Наименование) Экспорт
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектОрганизация = Организация.ПолучитьОбъект();
	ОбъектОрганизация.Наименование = СокрЛП(Наименование);
	
	Попытка
		ОбъектОрганизация.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Организации облачных приложений'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка, , , 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

// Обновляет ИНН и КПП организации.
//
// Параметры:
//   Организация - СправочникСсылка.ОрганизацииОблачныхПриложений - ссылка на организацию,
//   ИНН - Строка
//   КПП - Строка
//
Процедура ОбновитьИННиКПП(Организация, ИНН, КПП) Экспорт
	
	Если Не ЗначениеЗаполнено(ИНН) И Не ЗначениеЗаполнено(КПП) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектОрганизация = Организация.ПолучитьОбъект();
	ОбъектОрганизация.ИНН = СокрЛП(ИНН);
	ОбъектОрганизация.КПП = СокрЛП(КПП);
	
	Попытка
		ОбъектОрганизация.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Организации облачных приложений'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка, , , 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
